
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр трс_ПереходыОбъектовНедвижимости
	Движения.трс_ПереходыОбъектовНедвижимости.Записывать = Истина;
	Движение = Движения.трс_ПереходыОбъектовНедвижимости.Добавить();
	Движение.Период = Дата;
	Движение.ОбъектНедвижимости = ВыбывающийОбъект;
	Движение.НовыйПравообладатель = НовыйПравообладатель;
	Движение.ПредыдущийПравообладатель = ВыбывающийОбъект.Правообладатель;
	Движение.ДокументОснование = ДокументОснование;
	
	ОбъектСправочника = ВыбывающийОбъект.ПолучитьОбъект();
	ОбъектСправочника.Правообладатель = НовыйПравообладатель;
	ОбъектСправочника.НедвижимостьЛиквидирована = ЛиквидацияОбъектаНедвижимости; 
	// Если мы провели ликвидацию объекта, то он будет помечен как ликвидированный, 
	// но отмена проведения не должна возвращать его из ликвидации, 
	// чтобы это сделать, нужно провести новый документ, с новым правообладателем
	ОбъектСправочника.Записать();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	трс_ПереходыОбъектовНедвижимости.ПредыдущийПравообладатель КАК ПредыдущийПравообладатель
	               |ИЗ
	               |	РегистрСведений.трс_ПереходыОбъектовНедвижимости КАК трс_ПереходыОбъектовНедвижимости
	               |ГДЕ
	               |	трс_ПереходыОбъектовНедвижимости.Регистратор = &Регистратор";

	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ПредыдущийПравообладатель = Неопределено;
	Пока Выборка.Следующий() Цикл

		ПредыдущийПравообладатель = Выборка.ПредыдущийПравообладатель;

	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредыдущийПравообладатель) Тогда
		
		ОбъектСправочника = ВыбывающийОбъект.ПолучитьОбъект();
		ОбъектСправочника.Правообладатель = ПредыдущийПравообладатель;
		ОбъектСправочника.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(НовыйПравообладатель) И Не ЛиквидацияОбъектаНедвижимости Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			"Не заполнен Новый Правообладатель, но объект не ликвидируется",
			ЭтотОбъект,
			"НовыйПравообладатель",
			,
			Отказ
		);
	КонецЕсли;
	
КонецПроцедуры