#Область ДляВызоваИзДругихПодсистем
// СтандартныеПодсистемы.ВерсионированиеОбъектов
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
    Реквизиты.Добавить("ПрикрепленныеФайлы.ДокументКомментарий");
    Реквизиты.Добавить("ОсновныеДокументы.ДокументКомментарий");
    Реквизиты.Добавить("ОсновныеДокументы.ПлощадьПоДокументу");
    Реквизиты.Добавить("ДополнительныеДокументы.ДокументКомментарий");
    Реквизиты.Добавить("ДополнительныеДокументы.ПлощадьПоДокументу");
    
КонецПроцедуры
#КонецОбласти