
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	АктивацияАренды();
	АктивацияПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьНаименование();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПраваПриИзменении(Элемент)
	АктивацияАренды();
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	ОпределитьТипНедвижимости();
	АктивацияПоТипу();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АктивацияПоТипу()

	ОКС = Перечисления.трс_ТипНедвижимости.ОбъектКапитальногоСтроительства;
	ЕстьОКС = Ложь;
	Если Объект.ТипНедвижимости = ОКС Тогда
		ЕстьОКС = Истина;
	Иначе
		ЕстьОКС = Ложь;
	КонецЕсли;   
	ЕстьЗУ = НЕ ЕстьОКС; 
		
	Элементы.ИспользованиеЗдания.Видимость = ЕстьОКС;
	Элементы.ЦелевоеИспользование.Видимость = ЕстьОКС;
	Элементы.Назначение.Видимость = ЕстьОКС;
	Элементы.ГодЗавершенияСтроительства.Видимость = ЕстьОКС;
	Элементы.Этажность.Видимость = ЕстьОКС;
	
	Если ЕстьОКС Тогда
		Объект.КатегорияЗемель = Неопределено;
	Иначе
		Объект.ИспользованиеЗдания = Неопределено;
		Объект.ЦелевоеИспользование = Неопределено;
		Объект.Назначение = Неопределено;
		Объект.ГодЗавершенияСтроительства = Неопределено;
		Объект.Этажность = Неопределено;
	КонецЕсли;

	Элементы.КатегорияЗемель.Видимость = ЕстьЗУ;

КонецПроцедуры // АктивацияПоТипу()

&НаСервере
Процедура АктивацияАренды()

	Аренда = Перечисления.трс_ВидПрава.Аренда;
	Субаренда = Перечисления.трс_ВидПрава.Субаренда;
	Если Объект.ВидПрава = Аренда ИЛИ Объект.ВидПрава = Субаренда Тогда
		Элементы.КонецАренды.Видимость = Истина;
	Иначе
		Элементы.КонецАренды.Видимость = Ложь;
		Объект.КонецАренды = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОпределитьТипНедвижимости()
	
	ВозможныеВидыОбъекта = Перечисления.трс_ВидОбъекта;

	Если ЗначениеЗаполнено(Объект.ВидОбъекта) Тогда
		Если Объект.ВидОбъекта = ВозможныеВидыОбъекта.ЗемельныйУчасток или Объект.ВидОбъекта = ВозможныеВидыОбъекта.ЧастьЗемельногоУчастка Тогда
			Объект.ТипНедвижимости = Перечисления.трс_ТипНедвижимости.ЗемельныйУчасток;
		Иначе
			Объект.ТипНедвижимости = Перечисления.трс_ТипНедвижимости.ОбъектКапитальногоСтроительства;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОпределитьТипНедвижимости()

// Процедура проверяет на пустое наименование
// и создает стандартное наменование для объекта

&НаСервере
Процедура ЗаполнитьНаименование()

	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = трс_ОперацииНедвижимости.ЗаполнитьНаименование("Выписка ЕГРН на ", Объект.НаименованиеОбъектаНедвижимости, Объект.трс_ДатаВыдачи);
	КонецЕсли;

КонецПроцедуры // ЗаполнитьНаименование()

#КонецОбласти