
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор - Идентификатор формы
	// ПараметрыКоманды - Ссылка на объект
	
	// Проверка наличия файла
    Если Не ПроверитьФайл(ПараметрКоманды) Тогда
        ПоказатьПредупреждение(, "У объекта не выбран файл.");
        Возврат;
	КонецЕсли;
	
	ДанныеФайла = ДанныеФайла(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор, "ДляОткрытия");
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
		
КонецПроцедуры

&НаСервере
Функция ДанныеФайла(Знач СамОбъект, Знач ИдентификаторФормы = Неопределено, Знач Режим = "") Экспорт
	
	ПрисоединенныйФайл = СамОбъект.трс_Файл;
	
	РазблокироватьДанныеДляРедактирования(ПрисоединенныйФайл, ИдентификаторФормы);
	Если Режим = "ДляОткрытия" Тогда
		Возврат РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(
			ПрисоединенныйФайл, Неопределено, ИдентификаторФормы);
	ИначеЕсли Режим = "ДляСохранения" Тогда
		Возврат РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(
			ПрисоединенныйФайл,, ИдентификаторФормы);
	ИначеЕсли Режим = "ВызовСервера" Тогда
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыДанныхФайла.ИдентификаторФормы = ИдентификаторФормы;
		Возврат РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(ПрисоединенныйФайл,, ПараметрыДанныхФайла);
	Иначе
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Истина;
		ПараметрыДанныхФайла.ИдентификаторФормы = ИдентификаторФормы;
		Возврат РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ПараметрыДанныхФайла);
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПроверитьФайл(ПараметрКоманды)

	Если ЗначениеЗаполнено(ПараметрКоманды.трс_Файл) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ПроверитьФайл()
