&НаСервере
Функция ПолучитьНедвижимостьПоКН(КадастровыйНомер) Экспорт 
	
	КадастровыйНомер = СокрЛП(КадастровыйНомер);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	трс_НедвижимоеИмущество.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.трс_НедвижимоеИмущество КАК трс_НедвижимоеИмущество
	               |ГДЕ
	               |	трс_НедвижимоеИмущество.КадастровыйНомер = &КадастровыйНомер";

	Запрос.УстановитьПараметр("КадастровыйНомер", СокрЛП(КадастровыйНомер));

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл

		Возврат Выборка["Ссылка"];

	КонецЦикла;

КонецФункции // ПолучитьНедвижимостьПоКН()     

&НаСервере
Функция ЗаполнитьНаименование(Префикс, НаименованиеОбъектаНедвижимости, ДатаВыдачи) Экспорт 

	ДатаСтрокой = Формат(ДатаВыдачи, "ДЛФ=D");
	СтандартноеНаименование = Префикс 
		+ НаименованиеОбъектаНедвижимости 
		+ " от " 
		+ ДатаСтрокой;
	Возврат СтандартноеНаименование;	

КонецФункции // ЗаполнитьНаименование()