
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций

&НаСервере
Процедура ЛиквидацияОбъектаНедвижимостиПриИзмененииНаСервере()
	Элементы.НовыйПравообладатель.Видимость = Не Объект.ЛиквидацияОбъектаНедвижимости;
	Если Объект.ЛиквидацияОбъектаНедвижимости Тогда
		Объект.НовыйПравообладатель = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛиквидацияОбъектаНедвижимостиПриИзменении(Элемент)
	ЛиквидацияОбъектаНедвижимостиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбывающийОбъектПриИзменении(Элемент)
	ПроверкаТипаНедвижимости();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПроверкаТипаНедвижимости()

	Если Объект.ВыбывающийОбъект.ТипНедвижимости = Перечисления.трс_ТипНедвижимости.ЗемельныйУчасток Тогда
		Элементы.ЛиквидацияОбъектаНедвижимости.Видимость = Ложь;
		Объект.ЛиквидацияОбъектаНедвижимости = Ложь;
	Иначе
		Элементы.ЛиквидацияОбъектаНедвижимости.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры // ПроверкаТипаНедвижимости()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроверкаТипаНедвижимости();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверкаТипаНедвижимости();
КонецПроцедуры

&НаКлиенте
Процедура НовыйПравообладательПриИзменении(Элемент)
	ПроверкаНовогоПравообладателя();
КонецПроцедуры

&НаСервере
Процедура ПроверкаНовогоПравообладателя()

		
	Если Не Объект.НовыйПравообладатель = Неопределено Тогда
		Элементы.ЛиквидацияОбъектаНедвижимости.Видимость = Ложь;
		Объект.ЛиквидацияОбъектаНедвижимости = Ложь;
	КонецЕсли;

КонецПроцедуры // ПроверкаНовогоПравообладателя()


#КонецОбласти