#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьНаименование();

	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыЗаписи.Свойство("КомментарийКВерсии") Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);

	Оповещение = Новый ОписаниеОповещения("ПередЗаписьюПослеВводаКомментария", ЭтотОбъект, ДополнительныеПараметры);

	ПоказатьВводСтроки(Оповещение, "", НСтр("ru = 'Укажите причину изменений объекта'"), 0, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПослеВводаКомментария(ВведенноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВведенноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СокрЛП(ВведенноеЗначение)) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Комментарий обязателен для сохранения изменений.'"));
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры.ПараметрыЗаписи.Вставить("КомментарийКВерсии", ВведенноеЗначение);
	Записать(ДополнительныеПараметры.ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.Свойство("КомментарийКВерсии") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить(
			"ВерсионированиеОбъектовКомментарийКВерсии",
			ПараметрыЗаписи.КомментарийКВерсии);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаименование()
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = трс_ОперацииНедвижимости.ЗаполнитьНаименование("Схема размещения на ", Объект.КадастровыйНомер, Объект.трс_ДатаВыдачи);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
